# BoltSpacingShorterFlange Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionLAngle..::..BoltSpacingShorterFlange Property
StructuralSectionLAngle Class See Also
---
Standard bolt spacing in the shorter flange, in. (mm)
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double BoltSpacingShorterFlange { get; set; }
```

Visual Basic
---
```text
Public Property BoltSpacingShorterFlange As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double BoltSpacingShorterFlange {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionLAngle Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace